Autodesk.Revit.DB.Events.FileExportedEventArgs.Format
Identifies the export format, e.g. DWG or image.
Since:
2010

Autodesk.Revit.DB.Events.FileExportedEventArgs.Path
Target path for the exported file (or files).
Remarks:
In some cases the path represents only the target directory or a template name.
Such cases include batch export when more than one file is exported as one event.
Since:
2010

Autodesk.Revit.DB.Events.FileExportedEventArgs
The event arguments used by the FileExported event.
Since:
2010